##############################################
##############################################
##############################################
######### 월요일 

# 사용자의 HP와 레벨, 공격력을 입력받는다.
# 몬스터1의 HP와 공격력을 입력받는다.
# 몬스터2의 HP와 공격력을 입력받는다.
# key라는 변수 하나를 선언하고 값을 0으로 한다.
# 사용자의 레벨이 5이상, HP가 100이상일 경우, 스테이지 1에 진입한다.
# 스테이지 1에 진입시, 몬스터1의 공격력으로 사용자를 공격한다 만약 이때 사용자의 HP가 남아있을 경우, 
# 스테이지 1클리어를 출력하고 Key 1개 증가시킨다.
# 사용자의 HP가 남아있지 않을 경우 사망을 흡력한다.
# 이후, 사용자의 레빌이 10 이상, HP가 200이상일 경우, 스테이지 2에 진입한다 스테이지 2에 진입시, 몬스터2의 공격력으로 사용자를 공격한다.
# 만약 이때 사용자의 HP가 남아있을 경우, 스테이지 2클리어를 흘력하고 Key 1개 증가시킨다
# 이후, key가 2개 이상, 사용자의 HP가 0 이상일 경우, 게임 클리어 즐력

# 사용자의 HP와 레벨, 공격력을 입력받는다.
hp = int(input("사용자의 hp를 입력하세요: "))
level = int(input("사용자의 level를 입력하세요: "))
power = int(input("사용자의 power를 입력하세요: "))

# 몬스터1의 HP와 공격력을 입력받는다.
m1hp = int(input("몬스터1의 hp를 입력하세요: "))
m1power = int(input("몬스터1의 power를 입력하세요: "))

# 몬스터2의 HP와 공격력을 입력받는다.
m2hp = int(input("몬스터2의 hp를 입력하세요: "))
m2power = int(input("몬스터2의 power를 입력하세요: "))

key = 0

# 스테이지 1 진입 조건
if level >= 5 and hp >= 100:
    print("스테이지1 진입!")
    hp -= m1power 
    print("스테이지1 사용자 hp : ",hp)
    if hp > 0:
        print("스테이지1 클리어")
        key += 1
        print("현재 키 :",key)
    else:
        print("사망")
else:
    print("스테이지1 입장 불가")

# 스테이지 2 진입 조건
if level >= 10 and hp >= 200:
    print("스테이지2 진입!")
    hp -= m2power 
    print("스테이지2 사용자 hp : ",hp)
    if hp > 0:
        print("스테이지2 클리어")
        key += 1
        print("현재 키 :",key)
    else:
        print("사망")
else:
    print("스테이지2 입장 불가")

# 게임 클리어 조건
if key >= 2 and hp > 0:
    print("현재 키 : ",key,"남은 hp : ",hp)
    print("게임 클리어")