##############################################
##############################################
################총정리 영상######################
##############################################
##############################################


##############################################
#변수 

# 변수를 선언한다 -> 데이터를 저장하는 공간을 만든다 
a(집)=10(사람)
b = 10
b="집"
b=1+1
c=1.234
#변수를 이해하는게 가장 중요 !! 

##############################################
#print
a=10
b=20
print(10) #출력한다 괄호 안의 공간을 
print("문자에용")
print("a")
print("b")

print(a,b,2025) # 10 20 2025
print(a,a,a,a,a,a) #10 10 10 10 10
print("숫자는", 10, "입니다.")
print("숫자는", b, "입니다.")

print("숫자는", a+b, "입니다.")
print("숫자는", a-b, "입니다.")
print("숫자는", a*b, "입니다.")
print("숫자는", a/b, "입니다.") #나누기
print("숫자는", a//b, "입니다.") #몫
print("숫자는", a%b, "입니다.") #나머지

a="문자"
b=20
#문자와 숫자는 더하기 빼기가 할 수 없다. 
print("숫자는", a+b, "입니다.")
print("숫자는", a-b, "입니다.") 

## => 에러남 !! 

#곱셈은 가능 
#문자가 20번 출력됨 (반복)
print("숫자는", a*b, "입니다.") 

a="문자"
b="문자2"

print("숫자는"+a+"입니다.")
#숫자는문자입니다

print("숫자는",a+b,"입니다.")
#숫자는 문자문자2 입니다

#프로그래밍 언어는 위에서 아래로 실행됨 

a="문자"
b="문자2"
b=20 
print("숫자는",a+b,"입니다.")
#이면 최종 b=20 이 된다 
# 하지만 이대로 돌리면 오류가남 
# 이유는 문자+숫자는 안되기 때문에 !!


##############################################
#list (리스트)

a=[1,2,3,4,5,6,7,8,9,10]

print("숫자는",a,"입니다.")
#숫자는 [1,2,3,4,5,6,7,8,9,10] 입니다.

b=["오이","가지","콩나물","시금치"]
print("숫자는",b,"입니다.")
#숫자는 ["오이","가지","콩나물","시금치"] 입니다. 

print("숫자는",b[0],"입니다.")
#숫자는 오이 입니다.
b[0] == b[-0]

print("숫자는",b[-1],"입니다.")
#숫자는 시금치 입니다.

print("숫자는",b[0:2],"입니다.")
#숫자는 ["오이","가지"] 입니다.

print("숫자는",b[2:4],"입니다.")
#숫자는 ["콩나물","시금치"] 입니다.

c=["오이",["금가지","은가지"],"콩나물","시금치"]
print(c[1])
#["금가지","은가지"]
print(c)
#["오이",["금가지","은가지"],"콩나물","시금치"]

print(c[1][0])
#금가지
print(c[1][1])
#은가지

print("우와" +c[1])
#오류남!! -> 문자와 리스트 출력은 안됨 

print("우와" +c[1][0])
#이건 가능 왜냐면 
#우와금가지 로 출력됨 !! 
#c[1][0] == 금가지 로 문자이기 때문 

##############################################
#input
#사람한테 입력 받아서 반영 

a=input("숫자를 입력하세요")
b=20
print(a+b)

#이렇게하면 에러가 남 문자와 int 는 더할 수 없음 

a=input("숫자를 입력하세요")
#a=int(input("숫자를 입력하세요 ")) #이렇게도 적을 수 있음 
a=int(a) #이렇게 형변환
b=20
print(a+b)


a=int(input("숫자를 입력하세요 ")) 
b=input("문자를 입력하세요 ")
print(a*b)

#b에서 받은 문자를 a번만큼 반복한다 


a=input("나이를 입력하세요 ")
b=input("이름를 입력하세요 ")
c=input("좋아하는 것을 입력하세요 ")
print("나이는",a,"세이시고","이름은",b,"님이시군요",c,"를 좋아하시나봐요")

# 코딩할때 필요한건 
# 변수, 조건문, 반복문 -> 다 만들 수 있다. 나머지는 좀 더 쉽게 하기 위한 것 


##############################################
#if/elif

a=10
b=5
if a>5:
    print(a)
    print(a)
    print(a)
print(b)


a=10
b=5
if a>=15:
    print("if에요!")
elif 15>a>10:
    print("elif에요!2")
elif a>5:
    print("elif에요!3")
# 큰 순서대로 하거나 !! 범위 제대로 잘 보기 


##############################################
#if/elif
a=200000
b=5

if a>5:
    print("if에요1")
elif a>10:
    print("elif에요")
elif a>15:
    print("if에요3")

print(a)
print(b)

###### else 추가 
a=20
b=5

if a>15:
    print("if에요1")
else:
    print("그냥가")

print(a)
print(b)

##############################################
# 다중 if
a=16
b=5

if a>15:
    print("if에요1")
    if b>10:
        print("이거 덤으로 줄꼐")
    elif b>=5:
        print("담에 오면 하나 더 줄께")
    else:
        print("잘가")
elif a>10:
    print("elif에요")

##############################################
# 다중 if 리스트
a=["코로나","독감","수족구","홍역"]

if "독감" in a:
    print("전염병이네요")
elif "코로나" in a:
    print("전염병이네요")
elif "수족구" in a:
    print("전염병이네요")
elif "홍역" in a:
    print("전염병이네요")
else:
    print("")

#독감에 걸리면 전염병이네요 4개 다 출력되나? 
#아니다. 전염병이네요 하나만 출력됨 

user=input("병명을 입력하세요: ")
if user in a:
    print("전염병이네요")
else:
    print("그냥 병이네요")

a=["코로나","독감","수족구","홍역"]
b=["독감","수족구"]

##############################################

user=input("병명을 입력하세요: ")

if user in a:
    print("전염병이네요")
    if user in b:
        print("법정젼염병이네요 격리하세요")
else:
    print("그냥 병이네요")

##############################################


user=input("병명을 입력하세요: ")

if user in a:
    if user in b:
        print("법정젼염병이네요 격리하세요")
    else:
        print("전염병이네요")
else:
    print("그냥 병이네요")

##############################################
# and or 

a =10
b=20
#if a>5 and b>10: #and는 둘 다 충족 
#if a>5 or b>10: #or은 둘 중 하나만 충족 


if user in a and user in b: #둘 다 해당될거면 이렇게 해줘야함 
    print("법정전염병이네요 격리하세요.")
else:
    print("전염병이네요")

#코로나를 입력 받았을 때 : 전염병이네요 출력 

if user in a and b: 
    print("법정전염병이네요 격리하세요.")
else:
    print("전염병이네요")
#코로나 입력받았을 때 : 법정전염병이네요 격리하세요 출력됨 a와 b 모두에 해당하지 않는데

##############################################
# 반복문 
#코드를 계속 반복하는 것 
#while, for 

a=10
while a<15:
    print("반복중이에용")
#무한반복 

##############################################
a=0
while a<5:
    print("추가전",a)
    a=a+1
    print("추가후",a)
    print(a,"번째 반복 끝 ------------")

##############################################
a=0
while a<5:
    print("추가전",a)
    a=a+2
    print("추가후",a)
    print(a,"번째 반복 끝 ------------")

#2씩 증가 

##############################################
a=1
while a<10:
    print("2 X",a,"=",a*2)
    a=a+1

# 2 X 1 = 2
# 2 X 2 = 4
# 2 X 3 = 6
# 2 X 4 = 8
# 2 X 5 = 10
# 2 X 6 = 12
# 2 X 7 = 14
# 2 X 8 = 16
# 2 X 9 = 18

##############################################
user=int(input("단수를 입력하세요"))
a=1
while a<10:
    print(user,"X",a,"=",user*a)
    a=a+1
#입력받은 단수로 계산됨 

##############################################
user=int(input("단수를 입력하세요"))
user2=int(input("얼마까지?"))
a=1
while a<user2:
    print(user,"X",a,"=",user*a)
    a=a+1

    # if user*a >1000:
    #     break
    #숫자가 1000보다 커지면 멈춤 
    if user*a >1000 and a >50:
        break
    #곱한 숫자가 1000 보다 커도 a가 50이 안되면 계속 가다가 멈춤 


