# ##############################################
# ##############################################
# ##############################################
# ######### 월요일 

# # 사용자의 HP와 레벨, 공격력을 입력받는다.
# # 몬스터1의 HP와 공격력을 입력받는다.
# # 몬스터2의 HP와 공격력을 입력받는다.
# # key라는 변수 하나를 선언하고 값을 0으로 한다.
# # 사용자의 레벨이 5이상, HP가 100이상일 경우, 스테이지 1에 진입한다.
# # 스테이지 1에 진입시, 몬스터1의 공격력으로 사용자를 공격한다 만약 이때 사용자의 HP가 남아있을 경우, 
# # 스테이지 1클리어를 출력하고 Key 1개 증가시킨다.
# # 사용자의 HP가 남아있지 않을 경우 사망을 흡력한다.
# # 이후, 사용자의 레빌이 10 이상, HP가 200이상일 경우, 스테이지 2에 진입한다 스테이지 2에 진입시, 몬스터2의 공격력으로 사용자를 공격한다.
# # 만약 이때 사용자의 HP가 남아있을 경우, 스테이지 2클리어를 흘력하고 Key 1개 증가시킨다
# # 이후, key가 2개 이상, 사용자의 HP가 0 이상일 경우, 게임 클리어 즐력

# # 사용자의 HP와 레벨, 공격력을 입력받는다.
# hp = int(input("사용자의 hp를 입력하세요: "))
# level = int(input("사용자의 level를 입력하세요: "))
# power = int(input("사용자의 power를 입력하세요: "))

# # 몬스터1의 HP와 공격력을 입력받는다.
# m1hp = int(input("몬스터1의 hp를 입력하세요: "))
# m1power = int(input("몬스터1의 power를 입력하세요: "))

# # 몬스터2의 HP와 공격력을 입력받는다.
# m2hp = int(input("몬스터2의 hp를 입력하세요: "))
# m2power = int(input("몬스터2의 power를 입력하세요: "))

# key = 0

# # 스테이지 1 진입 조건
# if level >= 5 and hp >= 100:
#     print("스테이지1 진입!")
#     hp -= m1power 
#     print("스테이지1 사용자 hp : ",hp)
#     if hp > 0:
#         print("스테이지1 클리어")
#         key += 1
#         print("현재 키 :",key)
#     else:
#         print("사망")
# else:
#     print("스테이지1 입장 불가")

# # 스테이지 2 진입 조건
# if level >= 10 and hp >= 200:
#     print("스테이지2 진입!")
#     hp -= m2power 
#     print("스테이지2 사용자 hp : ",hp)
#     if hp > 0:
#         print("스테이지2 클리어")
#         key += 1
#         print("현재 키 :",key)
#     else:
#         print("사망")
# else:
#     print("스테이지2 입장 불가")

# # 게임 클리어 조건
# if key >= 2 and hp > 0:
#     print("현재 키 : ",key,"남은 hp : ",hp)
#     print("게임 클리어")


##############################################
##############################################
##############################################
######### 목요일 

# a= 1
# b=1
# while a < 50:
#     print("시험시험시험 .... 시르다",a)
#     a=a+1
#     while b <100:
#         print(a,"*",b,"=",a*b)
#         b=b+1
# b는 99로 2*99까지만 가고 a만 계속 출력

# a= 1
# b=1

# while a < 11:
#     print("구구단 출력",a,"단")
#     b=1
#     while b < 11:
#         print(a,"*",b,"=",a*b)
#         # print(a,"*",b,"=",a*b,end=" ")
#         b=b+1
#     a=a+1

# a = 1
# b = 1
# c = 1
# d = 1

# while a < 5:
#     b = 1  
#     while b < 5:
#         c = 1  
#         while c < 5:
#             d = 1 
#             while d < 5:
#                 print(a, "*", b, "*", c, "*", d, "=", a * b * c * d)
#                 d = d + 1 
#             c = c + 1 
#         b = b + 1 
#     a = a + 1 


#숫자를 입력하면, 2부터 그 숫자 사이에 있는 소수를 모두 출력하시오 

num = int(input("숫자를 입력하세요: "))
i = 2

while i <= num:
    is_prime = True
    j = 2
    while j * j <= i:  # 또는 j < i도 가능
        if i % j == 0:
            is_prime = False
            break
        j += 1
    if is_prime:
        print(i)
    i += 1
