#월요일 

#프로그래밍에서 가장 중요한 것 
#1. 변수 
#2. 조건문(if)
#3. 반복문 

# a = int(input("돈을 입력하세요:"))
# print(a)

# if a > 10000:
#     print("버거킹")
# if 10000 > a > 5000:
#     print("학식")
# if  5000 > a > 2000:
#     print("편의점")

# else:
#     print("돈없어")

######################################################
#2000만원이 생기면 뭐할지 if문 4개 작성하기 

# a = int(input("2000만원이 생기면 뭐할지 : "))
# print(a)

# if a == 2000:
#     print("차 사기")
# if 2000 > a > 1000:
#     print("주식")
# if  1000 > a > 500:
#     print("해외여행")
# if  a < 500:
#     print("그냥 풍족하게 먹고 지내기 ..")

######################################################
# a = int(input("2000만원이 생기면 뭐할지 : "))
# print(a)

# if a > 10000:
#     print("버거킹")
# elif a > 5000:
#     print("학식")
# elif a > 2000:
#     print("삼각김밥")
# else:
#     print("먹지마라")

a = int(input("2000만원이 생기면 뭐할지 : "))
print(a)

if a == 2000:
    print("차 사기")
elif a > 1000:
    print("주식")
elif a > 500:
    print("해외여행")
else:
    print("그냥 풍족하게 먹고 지내기 ..")

