#######################
####월요일

#숫자 입력 
# score = int(input("숫자를 입력하세요 : "))

# if score >= 90 and score <= 100:
#     print("A")
# elif score <= 89 and score >= 80:
#     print("B")
# elif score <= 79 and score >= 70:
#     print("C")
# elif score <= 69 and score >= 60:
#     print("D")
# elif score <=59:
#     print("F")

##############################################
#양의 정수를 입력 받아 아래와 같이 출력 
#0보다 작거나 같으면 : 입력 오류 
#2의 배수이면 2의 배수 
#5의 배수이면 5의 배수 
#2의 배수이면서 5의 배수이면 2,5의 공배수 

# num = int(input("양의 정수를 입력하세요 : "))
# if num <= 0:
#     print("입력오류")
# elif num % 2 == 0 and num % 5 == 0:
#     print("2와 5의 공배수")
# elif num % 2 == 0:
#     print("2의 배수")
# elif num % 5 == 0:
#     print("5의 배수")

####################################################
#머리속에 있는 걸 리스트로 만들고 
#3단계까지가기 
# head = ["수업","돈",["취업",["자소서", "이력서"]], "벚꽃","휴식"]
# print(head[2][1][0]) 


####################################################
#숫자로 된 초를 입력받는다 
#이걸 분,초로 바꿔서 출력 
#120 --> 2분 

# clock = int(input("초를 입력하세요 : "))
# min = clock // 60  
# sec = clock % 60  
# print(f"{min}분 {sec}초")



####################################################
#########목요일 

장비 = ["머리띠","귀걸이","목걸이","화장품","반지","양말","팔찌"]

# if "머리띠" in 장비:
#     print("귀걸이 사야겠다")

# if "머리띠" not in 장비:
#     print("머리띠 사야겠다")

##사용자한테 입력 받음 /... 어떤 장비인지 .. 그게 리스트에 있으면 대답해주기 
# pres = input("장비를 입력해주세요 : ")
# if pres in 장비:
#     print("이미 존재합니다")
# else:
#     print(pres + " 사야겠다")

# 리스트 2개 생성 1번은 브랜드명 / 2번은 제품명 
# 사용자한테 브랜드명과 제품명을 각각 입력 받음 
# 브랜드명이 1번 리스트에 있으면, 그 브랜드는 있습니다 라고 출력 
# 이후에 제품명이 2번 리스트에 있으면 브랜드명의 제품은 존재합니다 라고 출력 
# 샤넬에 크로스백은 있습니다 
# 만약 브랜드가 없으면 그 브랜드는 존재하지 않아요 라고 출력 
# 브랜드는 있지만 제품이 없으면 샤넬에 그런 제품은 없어요


brand = ["프라다","샤넬","미우미우","구찌","보테가","루이비통"]
cate = ["백팩","바지","치마","모자","바람막이","패딩"]

inbrand = input("브랜드명을 입력하세요 : ")
incate = input("카테고리를 입력하세요 : ")

if inbrand in brand:
    print(inbrand +"는 있습니다.")
    if incate in cate:
        print(inbrand + "의 " + incate +"는 있습니다.")
    else:
        print(inbrand + "에 그런 제품은 존재하지 않아요.")
else:
    print(inbrand +"는 존재하지 않아요.")